# Ultralytics YOLO26 🚀, AGPL-3.0 license
# Lightweight YOLO26 with enhanced BiFPN, GhostC3k2, and LAE for small-object detection

nc: 2  # number of classes

scales:
  n: [0.50, 0.25, 1024]

# ---------------- BACKBONE ----------------
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                 # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                # 1-P2/4
  - [-1, 3, C3k2, [256, False, 0.25]]         # 2-P2: increased repeats for more feature extraction
  - [-1, 1, Conv, [256, 3, 2]]                # 3-P3/8
  - [-1, 3, C3k2, [512, False, 0.25]]         # 4-P3: more repeats to better detect small victims
  - [-1, 1, Conv, [512, 3, 2]]                # 5-P4/16
  - [-1, 2, GhostC3k2, [512, True]]           # 6-P4: Ghost for speed
  - [-1, 1, Conv, [1024, 3, 2]]               # 7-P5/32
  - [-1, 2, GhostC3k2, [1024, True]]          # 8-P5: Ghost for speed
  - [-1, 1, LAE, []]                          # 9: Contextual encoding at P5
  - [-2, 1, LAE, []]                          # 10: Added LAE at P3 for small-object attention
  - [-1, 1, SPPF, [1024, 7]]                  # 11: larger receptive field for context
  - [-1, 2, C2PSA, [1024]]                    # 12

# ---------------- HEAD ----------------
head:
  # --- Reduction Layers ---
  - [4, 1, Conv, [64, 1, 1]]                  # 13: Reduced P3
  - [6, 1, Conv, [64, 1, 1]]                  # 14: Reduced P4
  - [11, 1, Conv, [64, 1, 1]]                 # 15: Reduced P5

  # --- Top-Down Path ---
  - [-1, 1, nn.Upsample, [None, 2, "bilinear"]] # 16: P5 upsample
  - [[-1, 14], 2, Bi_FPN, [96]]               # 17: P5_up + P4_red -> P4_td, 2 repeats, wider channels

  - [-1, 1, nn.Upsample, [None, 2, "bilinear"]] # 18: P4_td up
  - [[-1, 13], 2, Bi_FPN, [96]]               # 19: P4_up + P3_red -> P3_out, 2 repeats, better fusion

  # --- Bottom-Up Path ---
  - [-1, 1, Conv, [96, 3, 2]]                 # 20: P3_out down
  - [[-1, 17], 2, Bi_FPN, [96]]               # 21: P3_down + P4_td -> P4_out

  - [-1, 1, Conv, [96, 3, 2]]                 # 22: P4_out down
  - [[-1, 15], 2, Bi_FPN, [96]]               # 23: P4_down + P5_red -> P5_out

  # --- Detect ---
  - [[19, 21, 23], 1, Detect, [nc]]           # 24